uhnp/src/InformationRegisters/тн_Интеграция_ЛогСообщений/тн_Интеграция_ЛогСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_Интеграция_ЛогСообщений</name>
  <comment>Выполнение задач № 000035594</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>XML_ПакетВходящий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>XML_ПакетИсходящий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>УниверсальнаяДатаВходящееСообщение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УниверсальнаяДатаИсходящееСообщение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСообщения</name>
    <type>
      <types>EnumRef.тн_ВидыСообщенийFinApp</types>
      <types>EnumRef.тн_ВидыСообщенийPortal</types>
      <types>EnumRef.тн_ВидыСообщений_ERP_УХ</types>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.тн_ВидыСобытийИнтеграции</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаРеспондентИД</name>
    <comment>Выполнение задач №000041384</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДСообщения</name>
    <comment>// Чекордина Ирина 10.12.2025 Выполнение задач №000056084</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидИнтеграции</name>
    <type>
      <types>EnumRef.тн_ВидыИнтеграций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/тн_Интеграция_ЛогСообщений/ManagerModule.bsl
// НАЧАЛО Борисенко Игорь 08.06.2022 Выполнение задач №000041384
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// КОНЕЦ Борисенко Игорь 08.06.2022 Выполнение задач №000041384

// НАЧАЛО Борисенко Игорь 08.06.2022 Выполнение задач №000041384
//Процедура ДобавитьЛогСообщения(ВидИнтеграции, КлючСтроковый = "", XML_ПакетВходящий = "", XML_ПакетИсходящий = "", УниверсальнаяДатаВходящееСообщение = 0, УниверсальнаяДатаИсходящееСообщение = 0, ВидСообщения = "", ВидСобытия = "", ОписаниеОшибки = "") Экспорт
Процедура ДобавитьЛогСообщения(ВидИнтеграции, КлючСтроковый = "", XML_ПакетВходящий = "", XML_ПакетИсходящий = "", УниверсальнаяДатаВходящееСообщение = 0, УниверсальнаяДатаИсходящееСообщение = 0, ВидСообщения = "", ВидСобытия = "", ОписаниеОшибки = "", БазаРеспондентИД = "") Экспорт
// КОНЕЦ Борисенко Игорь 08.06.2022 Выполнение задач №000041384
	
	ТекущийКлючЗаписи = ?(ЗначениеЗаполнено(КлючСтроковый), Новый УникальныйИдентификатор(КлючСтроковый), Новый УникальныйИдентификатор());
	
	НаборЗаписей = РегистрыСведений.тн_Интеграция_ЛогСообщений.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ВидИнтеграции.Установить(ВидИнтеграции);
	НаборЗаписей.Отбор.Ключ.Установить(ТекущийКлючЗаписи);
	
	Запись = НаборЗаписей.Добавить();
	Запись.ВидИнтеграции                       = ВидИнтеграции;
	Запись.Ключ                                = ТекущийКлючЗаписи;
	//НАЧАЛО Блинова М.А. 29.04.2026 Выполнение задач №000057501
	//Запись.Период                              = ТекущаяДата();
	Запись.Период                              = ТекущаяДатаСервера();
	//КОНЕЦ Блинова М.А. 29.04.2026 Выполнение задач №000057501
	Запись.XML_ПакетВходящий                   = XML_ПакетВходящий;
	Запись.XML_ПакетИсходящий                  = XML_ПакетИсходящий;
	Запись.УниверсальнаяДатаВходящееСообщение  = УниверсальнаяДатаВходящееСообщение;
	Запись.УниверсальнаяДатаИсходящееСообщение = УниверсальнаяДатаИсходящееСообщение;
	Запись.ВидСообщения                        = ВидСообщения;
	Запись.ВидСобытия                          = ВидСобытия;
	Запись.ОписаниеОшибки                      = ОписаниеОшибки;
	// НАЧАЛО Борисенко Игорь 08.06.2022 Выполнение задач №000041384
	Запись.БазаРеспондентИД                    = БазаРеспондентИД;
	// КОНЕЦ Борисенко Игорь 08.06.2022 Выполнение задач №000041384
	
	НаборЗаписей.Записать(Истина);
			
КонецПроцедуры

//~ Чекордина Ирина 10.12.2025 Выполнение задач №000056084: +Парам ИДСообщения
//// НАЧАЛО Борисенко Игорь 08.06.2022 Выполнение задач №000041384
////Процедура ДобавитьЛогСообщенияВходящего(ВидИнтеграции, Ключ, XML_Пакет, ВидСообщения = "", ВидСобытия = "", ОписаниеОшибки = "") Экспорт
//Процедура ДобавитьЛогСообщенияВходящего(ВидИнтеграции, Ключ, XML_Пакет, ВидСообщения = "", ВидСобытия = "", ОписаниеОшибки = "", БазаРеспондентИД = "") Экспорт
//// КОНЕЦ Борисенко Игорь 08.06.2022 Выполнение задач №000041384
Процедура ДобавитьЛогСообщенияВходящего(ВидИнтеграции, Ключ, XML_Пакет, ВидСообщения = "", ВидСобытия = "", ОписаниеОшибки = "", БазаРеспондентИД = "", ИДСообщения = "") Экспорт
	
	ТекущийКлючЗаписи = ?(ТипЗнч(Ключ) = Тип("УникальныйИдентификатор"), Ключ, Новый УникальныйИдентификатор(Ключ));
	
	НаборЗаписей = РегистрыСведений.тн_Интеграция_ЛогСообщений.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ВидИнтеграции.Установить(ВидИнтеграции);
	НаборЗаписей.Отбор.Ключ.Установить(ТекущийКлючЗаписи);
	
	Запись = НаборЗаписей.Добавить();
	Запись.ВидИнтеграции                       = ВидИнтеграции;
	Запись.Ключ                                = ТекущийКлючЗаписи;
	//НАЧАЛО Блинова М.А. 29.04.2026 Выполнение задач №000057501
	//Запись.Период                              = ТекущаяДата();
	Запись.Период                              = ТекущаяДатаСервера();
	//КОНЕЦ Блинова М.А. 29.04.2026 Выполнение задач №000057501
	Запись.XML_ПакетВходящий                   = XML_Пакет;
	Запись.XML_ПакетИсходящий                  = "";
	Запись.УниверсальнаяДатаВходящееСообщение  = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Запись.УниверсальнаяДатаИсходящееСообщение = 0;
	Запись.ВидСообщения                        = ВидСообщения;
	Запись.ВидСобытия                          = ВидСобытия;
	Запись.ОписаниеОшибки                      = ОписаниеОшибки;
	// НАЧАЛО Борисенко Игорь 08.06.2022 Выполнение задач №000041384
	Запись.БазаРеспондентИД                    = БазаРеспондентИД;
	// КОНЕЦ Борисенко Игорь 08.06.2022 Выполнение задач №000041384
	// НАЧАЛО Чекордина Ирина 10.12.2025 Выполнение задач №000056084
	Запись.ИДСообщения						   = ИДСообщения;
	// КОНЕЦ Чекордина Ирина 10.12.2025 Выполнение задач №000056084
	
	НаборЗаписей.Записать(Истина);
			
КонецПроцедуры

// НАЧАЛО Борисенко Игорь 08.06.2022 Выполнение задач №000041384
//Процедура ДобавитьЛогСообщенияИсходящего(ВидИнтеграции, Ключ, XML_Пакет = Неопределено, ВидСообщения = "", ВидСобытия = "", ОписаниеОшибки = "") Экспорт
Процедура ДобавитьЛогСообщенияИсходящего(ВидИнтеграции, Ключ, XML_Пакет = Неопределено, ВидСообщения = "", ВидСобытия = "", ОписаниеОшибки = "", БазаРеспондентИД = "") Экспорт
// КОНЕЦ Борисенко Игорь 08.06.2022 Выполнение задач №000041384
	
	ТекущийКлючЗаписи = ?(ТипЗнч(Ключ) = Тип("УникальныйИдентификатор"), Ключ, Новый УникальныйИдентификатор(Ключ));
	
	НаборЗаписей = РегистрыСведений.тн_Интеграция_ЛогСообщений.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ВидИнтеграции.Установить(ВидИнтеграции);
	НаборЗаписей.Отбор.Ключ.Установить(ТекущийКлючЗаписи);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда 
		Запись = НаборЗаписей[0];
	Иначе 
		Запись = НаборЗаписей.Добавить();
	КонецЕсли;
	
	//НАЧАЛО Блинова М.А. 29.04.2026 Выполнение задач №000057501
	//Запись.Период                              = ТекущаяДата();
	Запись.Период                              = ТекущаяДатаСервера();
	//КОНЕЦ Блинова М.А. 29.04.2026 Выполнение задач №000057501
	Запись.Ключ                                = ТекущийКлючЗаписи;
	Запись.ВидИнтеграции                       = ВидИнтеграции;
	
	Если НЕ (XML_Пакет = Неопределено) Тогда 
		Запись.XML_ПакетИсходящий                  = XML_Пакет;
	КонецЕсли;
	
	Запись.УниверсальнаяДатаИсходящееСообщение = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Если ЗначениеЗаполнено(ВидСообщения) Тогда 
		Запись.ВидСообщения                        = ВидСообщения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидСобытия) Тогда 
		Запись.ВидСобытия                          = ВидСобытия;
	КонецЕсли;
	
	Запись.ОписаниеОшибки                      = ОписаниеОшибки;
	// НАЧАЛО Борисенко Игорь 08.06.2022 Выполнение задач №000041384
	Запись.БазаРеспондентИД                    = БазаРеспондентИД;
	// КОНЕЦ Борисенко Игорь 08.06.2022 Выполнение задач №000041384
	
	НаборЗаписей.Записать(Истина);
			
КонецПроцедуры

//~ Чекордина Ирина 10.12.2025 Выполнение задач №000056084: +Парам ИДСообщения
//// Кудинов А.А. 15.05.2017 Выполнение задач №000024811 
//// НАЧАЛО Калинин А. 22.05.2018 Выполнение задач №000028467
////Процедура ДобавитьЛогОшибки(ВидИнтеграции, Ключ, ВидСобытия = "", ОписаниеОшибки = "") Экспорт
//// НАЧАЛО Борисенко Игорь 08.06.2022 Выполнение задач №000041384
////Процедура ДобавитьЛогОшибки(ВидИнтеграции, Ключ, ВидСобытия = "", ОписаниеОшибки = "", ВидСообщения = "") Экспорт
//Процедура ДобавитьЛогОшибки(ВидИнтеграции, Ключ, ВидСобытия = "", ОписаниеОшибки = "", ВидСообщения = "", БазаРеспондентИД = "") Экспорт
//// КОНЕЦ Борисенко Игорь 08.06.2022 Выполнение задач №000041384
//// КОНЕЦ Калинин А. 22.05.2018 Выполнение задач №000028467
Процедура ДобавитьЛогОшибки(ВидИнтеграции, Ключ, ВидСобытия = "", ОписаниеОшибки = "", ВидСообщения = "", БазаРеспондентИД = "", ИДСообщения = "") Экспорт
	
	ТекущийКлючЗаписи = ?(ТипЗнч(Ключ) = Тип("УникальныйИдентификатор"), Ключ, Новый УникальныйИдентификатор(Ключ));
	
	НаборЗаписей = РегистрыСведений.тн_Интеграция_ЛогСообщений.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ВидИнтеграции.Установить(ВидИнтеграции);
	НаборЗаписей.Отбор.Ключ.Установить(ТекущийКлючЗаписи);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда 
		Запись = НаборЗаписей[0];
	Иначе 
		Запись = НаборЗаписей.Добавить();
		// НАЧАЛО Калинин А. 22.05.2018 Выполнение задач №000028467
		Запись.ВидИнтеграции                       = ВидИнтеграции;
		Запись.Ключ                                = ТекущийКлючЗаписи;
		//НАЧАЛО Блинова М.А. 29.04.2026 Выполнение задач №000057501
		//Запись.Период                              = ТекущаяДата(); 
		Запись.Период                              = ТекущаяДатаСервера(); 
		//КОНЕЦ Блинова М.А. 29.04.2026 Выполнение задач №000057501
		Если ЗначениеЗаполнено(ВидСообщения) Тогда 
			Запись.ВидСообщения                    = ВидСообщения;	
		КонецЕсли;
		// КОНЕЦ Калинин А. 22.05.2018 Выполнение задач №000028467
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидСобытия) Тогда 
		Запись.ВидСобытия                          = ВидСобытия;
	КонецЕсли;
	
	Запись.ОписаниеОшибки                      = ОписаниеОшибки;
	// НАЧАЛО Борисенко Игорь 08.06.2022 Выполнение задач №000041384
	Запись.БазаРеспондентИД                    = БазаРеспондентИД;
	// КОНЕЦ Борисенко Игорь 08.06.2022 Выполнение задач №000041384
	// НАЧАЛО Чекордина Ирина 10.12.2025 Выполнение задач №000056084
	Запись.ИДСообщения						   = ИДСообщения;
	// КОНЕЦ Чекордина Ирина 10.12.2025 Выполнение задач №000056084
	
	НаборЗаписей.Записать(Истина);
			
КонецПроцедуры

// НАЧАЛО Борисенко Игорь 08.06.2022 Выполнение задач №000041384
#КонецЕсли
// КОНЕЦ Борисенко Игорь 08.06.2022 Выполнение задач №000041384
